[
    {
      "Image": "forEachImage/motehingar.jpg",
      "Name": "Mote Hin Gar",
      "Ingredients": " 300g catfish (or use whole trout)1 lemon grass stalk, bruised ¼ teaspoon ground turmeric 500ml water\n1 large onion, chopped\n3 cloves garlic\n1cm fresh ginger\n2 lemon grass stalks, white part only\n3 whole dried chillies, soaked in hot water\n1 teaspoon shrimp paste\n½ teaspoon paprika\n½ teaspoon ground turmeric\n6 tablespoons peanut oil\n1.5 litres water\n100g young banana stem\nsliced(alternatively use 12 small shallots\npeeled)75g ground rice powder\nroasted\n3 tablespoons fish sauce\n1 teaspoon ground black pepper",
      "CookingInstructions": "Put the fish in a large pan, add the water, lemon grass and turmeric. Bring to the boil and simmer for 6-10 minutes until the fish is just cooked. Remove the fish from the pan and when cool enough to handle, peel the skin and flake the flesh, discarding any bones. Drain the fish stock through a sieve and reserve for the soup.Pound the onion, garlic, ginger, dried chillies and lemon grass into a paste in a pestle and mortar, otherwise just chop everything as finely as you can.Heat the oil in a saucepan and add the onion paste. Cook over moderate heat for 15-20 minutes until the paste is soft and caramelised. Add the shrimp paste, mash with a wooden spoon until incorporated, then mix in the turmeric and paprika. Cook for a further minute until the spices are fragrant before adding the flaked fish. Pop the lid on and cook for 10-15 minutes, allowing all the flavours from the onion paste to infuse into the fish.The soup paste is done. If you are making this in advance, cool the mixture completely and pop in the freezer. It will keep for up to 1 month.To make the soup: put the soup paste (completely defrosted if using from frozen), rice powder, water and the reserved fish stock (or 500ml of water if not using fish stock) in a large pan. Bring to a boil while stirring continuously to make sure the rice powder doesn’t clump. Add the shallots or banana stem and simmer for 20-30 minutes until they are tender. Add the fish sauce and taste for seasoning. Finally add lots of black pepper before serving.To serve, put a handful of noodles in a bowl and ladle over the soup. Let everyone add the garnishes as they wish. It should taste spicy, salty and tangy from the limes.",
      "time": "50-70 mins",
      "id": "1"
    },
    {
      "Image": "forEachImage/tofunway.jpg",
      "Name": "To fu Nway",
      "Ingredients": "400 g chickpea flour\n ¼ tsp turmeric\ncooked rice noodles\npre-made chicken curry or vegetable\ntofu, etc.\nfried garlic\nsweet soy sauce\nunsalted peanuts roasted and crushed\nlime wedges\ngreen onions chopped",
      "CookingInstructions": "In a large bowl, whisk the chickpea flour, turmeric, and 1 liter cold water together until smooth. Leave to settle overnight.The next day, ladle the liquid from the top of the chickpea mixture into a large pan. Put over a low heat and cook for 15 minutes, stirring or whisking so it doesn’t go lumpy. Now begin to add a few tablespoons of the remaining chickpea mixture every 2 minutes for the next 15 minutes, whisking or stirring often, until all the mixture is incorporated. The liquid will get thicker and thicker.Divide the noodles among soup bowls. Ladle the chickpea mixture over the noodles, then top with the chicken curry. Top each bowl with the remaining garnishes. Stir it up and enjoy!",
      "time": "40 mins",
      "id": "2"
    },
    {
      "Image": "forEachImage/tealeaf.jpg",
      "Name": "Tea Leaf Salad",
      "Ingredients": "2 tablespoons loose green tea leaves, such as sencha or Dragonwell\n2 cups very hot water (about 190 degrees F)\n1 clove garlic, coarsely chopped\n½ teaspoon salt\n3 tablespoons fried garlic oil (see Tips) or canola oil\n1 teaspoon distilled white vinegarn\n4 cups shredded green cabbage\n1 ½ cups roughly chopped cherry tomatoes\n½ jalapeño or serrano chile, seeded and minced\n¼ cup fried garlic (see Tips)\n¼ cup coarsely chopped toasted peanuts\n¼ cup fried yellow split peas (see Tips)\n1 tablespoon fried garlic oil (see Tips) or canola oil\n1 tablespoon lime juice\n2 teaspoons fish sauce (see Tips)\n½ cup coarsely chopped fresh cilantro\n2 tablespoons dried shrimp powder (optional; see Tips)\n¼ teaspoon crushed red pepper",
      "CookingInstructions": "Pour 4 cups of hot water over the dried tea leaves, stir, and let soak until the leaves have expanded and are quite soft, about 10 minutes. Then drain, pick through the leaves, and discard any tough bits. Squeeze out any remaining liquid from the tea leaves as thoroughly as possible. Next place the tea leaves in lukewarm water and mash with your hands a little. Drain and squeeze out extra liquid. Repeat this rinse once more, then add cold water and let stand for 1 hour (or as long as overnight). This longer soak helps to remove the strongest, tart and bitter edge of the tea. Drain, squeeze thoroughly to remove excess water, and discard any remaining tough bits. Chop the leaves finely and mix together with about 1 cup finely chopped kale, 1 loosely packed cup mixed chopped cilantro and scallion greens, 2 tablespoons finely chopped ginger, 1 tablespoon of garlic paste, a generous pinch of salt, and the juice of 1 lime. For an extra kick include 2 minced green chilies. Cover the dish tightly and allow it to ferment, untouched, for two days in a dark, cool space, like a pantry. After two days, place the container in the refrigerator. It's ready to serve!",
      "time": "30 mins",
      "id": "3"
    }
]